say " give the value of ' a ' for SELECT  "
PULL A;
say a
say "bofore select 1 "
select
  when a=1 then
	  say "a is 1111111 "
  when a=2 then say "a is 22222222222"

end

say "after select 1 "

